# UnexpectedFamilyChangeResultsError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..UnexpectedFamilyChangeResultsError Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Changing the family for a MEP fitting might cause unexpected results.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnexpectedFamilyChangeResultsError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnexpectedFamilyChangeResultsError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnexpectedFamilyChangeResultsError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace